tests/artillery/ramp.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "warm-up"
    - duration: 60
      arrivalRate: 20
      name: "ramp to 20 rps"
    - duration: 60
      arrivalRate: 40
      name: "ramp to 40 rps"
  defaults:
    headers:
      User-Agent: "Artillery-RAMP"
scenarios:
  - name: "GET / ramp"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200